---
kind: property
id: P:Autodesk.Revit.DB.Analysis.ViewSystemsAnalysisReport.SystemsAnalysisOutputFolder
source: html/f7814f7b-fdd7-79cc-bda3-7b6bd4906ed1.htm
---
# Autodesk.Revit.DB.Analysis.ViewSystemsAnalysisReport.SystemsAnalysisOutputFolder Property

The full path of the output folder for systems analysis

## Syntax (C#)
```csharp
public string SystemsAnalysisOutputFolder { get; }
```